/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: loongarchUnaligned.h
**
** 创   建   人: Wang.Ziyang (王子阳)
**
** 文件创建日期: 2022 年 04 月 09 日
**
** 描        述: LoongArch 非对齐处理.
*********************************************************************************************************/

#ifndef __ARCH_LOONGARCHUNALIGNED_H
#define __ARCH_LOONGARCHUNALIGNED_H

VOID  loongarchUnalignedHandle(ARCH_REG_CTX  *pregctx, PLW_VMM_ABORT  pabtInfo);

#endif                                                                  /*  __ARCH_LOONGARCHUNALIGNED_H */
/*********************************************************************************************************
  END
*********************************************************************************************************/
