/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: vutexLib.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2020 年 12 月 26 日
**
** 描        述: 等待变量锁内部实现.
*********************************************************************************************************/

#ifndef __VUTEXLIB_H
#define __VUTEXLIB_H

/*********************************************************************************************************
  内部函数
*********************************************************************************************************/

BOOL  _VutexWakeIsAll(PLW_CLASS_TCB  ptcb);
BOOL  _VutexWakeIsMatch(INT  iValue, INT  iCompare, INT  iDesired);
INT   _VutexWakeQueue(phys_addr_t  phyaddr, INT32  iValue, INT  iFlags);
VOID  _VutexWaitQueue(PLW_CLASS_TCB  ptcbCur, phys_addr_t  phyaddr, INT32  iDesired, INT  iCompare);

#endif                                                                  /*  __VUTEXLIB_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
