/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: devtree_error.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2019 年 06 月 24 日
**
** 描        述: 设备树错误号
*********************************************************************************************************/

#ifndef __DEVTREE_ERROR_H
#define __DEVTREE_ERROR_H

/*********************************************************************************************************
  设备树 6000 - 6500
*********************************************************************************************************/

#define ERROR_DEVTREE_MAGIC_ERROR           6000                        /*  设备树数据错误              */
#define ERROR_DEVTREE_DEPTH_ERROR           6001                        /*  设备树当前层次错误          */
#define ERROR_DEVTREE_SCAN_ERROR            6002                        /*  设备树扫描错误              */
#define ERROR_DEVTREE_POPULATE_ERROR        6003                        /*  设备树解析错误              */
#define ERROR_DEVTREE_MEM_OVERLAP           6004                        /*  设备树内存产生重叠          */
#define ERROR_DEVTREE_TABLE_NULL            6005                        /*  设备树匹配表格为空          */
#define ERROR_DEVTREE_EPROBE_DEFER          6006                        /*  设备树 probe 出错           */

#endif                                                                  /*  __DEVTREE_ERROR_H           */
/*********************************************************************************************************
  END
*********************************************************************************************************/
