/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: arm64Mmu.h
**
** 创   建   人: Wang.Xuan (王翾)
**
** 文件创建日期: 2018 年 07 月 04 日
**
** 描        述: ARM64 体系构架 MMU 驱动.
*********************************************************************************************************/

#ifndef __ARM64MMU_H
#define __ARM64MMU_H

/*********************************************************************************************************
  页大小支持
*********************************************************************************************************/

#define ARM64_MMFR_TGRAN4_SHIFT         28
#define ARM64_MMFR_TGRAN64_SHIFT        24
#define ARM64_MMFR_TGRAN16_SHIFT        20
#define ARM64_MMFR_TGRAN4_NSUPPORT      0xf
#define ARM64_MMFR_TGRAN64_NSUPPORT     0xf
#define ARM64_MMFR_TGRAN16_NSUPPORT     0x0

VOID   arm64MmuInit(LW_MMU_OP  *pmmuop, CPCHAR  pcMachineName);
ULONG  arm64MmuGetMMFR0(VOID);
ULONG  arm64MmuGetMMFR1(VOID);
ULONG  arm64MmuAbtFaultAddr(VOID);

#endif                                                                  /*  __ARM64MMU_H                */
/*********************************************************************************************************
  END
*********************************************************************************************************/
