/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: un.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2012 年 12 月 18 日
**
** 描        述: AF_UNIX 协议域头文件.
*********************************************************************************************************/

#ifndef __SYS_UN_H
#define __SYS_UN_H

#include <sys/types.h>
#include <sys/ioctl.h>

/*********************************************************************************************************
  Definitions for UNIX IPC domain
*********************************************************************************************************/

struct sockaddr_un {
    uint8_t sun_len;                                                /* sockaddr len including null      */
    uint8_t sun_family;                                             /* AF_UNIX                          */
    char    sun_path[104];                                          /* path name (gag)                  */
};

/*********************************************************************************************************
  Actual length of an initialized sockaddr_un
*********************************************************************************************************/

#define SUN_LEN(su) \
        (sizeof(*(su)) - sizeof((su)->sun_path) + strlen((su)->sun_path))

/*********************************************************************************************************
  Special ioctl commands (ONLY for EdgerOS!)
*********************************************************************************************************/

struct unix_temp_mode {
    int   enable;
    pid_t peer;
    long  reserve[8];
};

#define UNIXCGTEMPMODE  _IOR('u', 0, struct unix_temp_mode)         /* Get DGRAM temporary link mode    */
#define UNIXCSTEMPMODE  _IOW('u', 0, struct unix_temp_mode)         /* Set DGRAM temporary link mode    */

#endif                                                              /* __SYS_UN_H                       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
